{
  "navbar": {
    "home": "Index",
    "downloads": "Téléchargements",
    "about": "À Propos De",
    "support": "Aide"
  },
  "description": "L'outil Reset Windows Update Tool est un puissant outil de réparation du système conçu pour prendre en charge une série d'options de réparation. Avec cet outil, les utilisateurs peuvent facilement réinitialiser les composants de Windows Update, supprimer les fichiers temporaires, analyser, détecter et réparer toutes les corruptions dans l'image du système Windows, analyser tous les fichiers système protégés, remplacer tous les fichiers corrompus, modifier les valeurs invalides dans le Registre Windows, réinitialiser les paramètres Winsock et bien plus encore. Cet outil polyvalent peut aider les utilisateurs à résoudre toute une série de problèmes système, ce qui en fait un composant essentiel de toute boîte à outils complète de réparation de système.",
  "glosary": {
    "title": "Glossaire",
    "dism": "Deployment Image Servicing and Management est un outil en ligne de commande utilisé pour monter et réparer les images Windows avant leur déploiement.",
    "fix-it": "C'est un programme de diagnostic qui permet de détecter les problèmes susceptibles de compromettre le bon fonctionnement de Windows.",
    "registry": "Il s'agit d'une base de données hiérarchique centrale introduite dans Microsoft Windows 95 et Windows NT pour stocker les informations nécessaires à la configuration du système pour un ou plusieurs utilisateurs, applications et périphériques matériels.",
    "restore-point": "Il s'agit d'une représentation d'un état stocké des fichiers système de l'ordinateur.",
    "sfc": "System File Checker est un utilitaire Windows qui permet aux utilisateurs de vérifier si les fichiers système Windows sont corrompus et de restaurer les fichiers endommagés.",
    "winsock": "Il s'agit d'une bibliothèque dynamique de fonctions DLL pour Windows, créée dans le but d'implémenter TCP/IP. Elle prend en charge l'envoi et la réception de paquets de données sur des sockets BSD."
  },
  "references": {
    "title": "Reference",
    "reset-components": "Comment réinitialiser les composants de Windows Update?",
    "sfc": "Utilisez l'outil System File Checker pour réparer les fichiers système manquants ou corrompus",
    "dism": "Corriger les erreurs de Windows Update en utilisant l'outil DISM ou System Update Readiness"
  }
}
