{
  "description": "Das Reset Windows Update Tool ist ein leistungsstarkes Systemreparaturtool, das eine Reihe von Reparaturoptionen unterstützt. Mit diesem Tool können Benutzer ganz einfach Windows Update-Komponenten zurücksetzen, temporäre Dateien löschen, alle Beschädigungen im Windows-Systemabbild scannen, erkennen und reparieren, alle geschützten Systemdateien scannen, beschädigte Dateien ersetzen, ungültige Werte in der Windows-Registrierung ändern, Winsock-Einstellungen zurücksetzen und vieles mehr. Dieses vielseitige Tool kann Anwendern bei der Lösung einer Vielzahl von Systemproblemen helfen und ist damit ein unverzichtbarer Bestandteil eines umfassenden Systemreparatur-Toolkits.",
  "glosary": {
    "title": "Glossar",
    "dism": "Deployment Image Servicing and Management ist ein Befehlszeilentool, das zum Einhängen und Reparieren von Windows-Images vor der Bereitstellung verwendet wird.",
    "fix-it": "Es handelt sich um ein Diagnoseprogramm, mit dem Sie Probleme erkennen können, die das ordnungsgemäße Funktionieren von Windows beeinträchtigen können.",
    "registry": "Es handelt sich um eine zentrale hierarchische Datenbank, die in Microsoft Windows 95 und Windows NT eingeführt wurde, um Informationen zu speichern, die zur Konfiguration des Systems für einen oder mehrere Benutzer, Anwendungen und Hardwaregeräte benötigt werden.",
    "restore-point": "Es handelt sich um eine Darstellung eines gespeicherten Zustands der Systemdateien des Computers.",
    "sfc": "Die Systemdateiprüfung ist ein Windows-Dienstprogramm, mit dem Benutzer Windows-Systemdateien auf Beschädigungen überprüfen und beschädigte Dateien wiederherstellen können.",
    "winsock": "Es handelt sich um eine dynamische Bibliothek von DLL-Funktionen für Windows, die zur Implementierung von TCP/IP erstellt wurde. Enthält Unterstützung für das Senden und Empfangen von Datenpaketen über BSD-Sockets."
  },
  "references": {
    "title": "Referenz",
    "reset-components": "Wie setze ich Windows Update-Komponenten zurück?",
    "sfc": "Verwenden Sie das Systemdatei-Überprüfungsprogramm, um fehlende oder beschädigte Systemdateien zu reparieren",
    "dism": "Beheben Sie Windows Update-Fehler mit dem DISM- oder System Update Readiness-Tool"
  }
}
