{
  "description": "A ferramenta Reset Windows Update Tool é uma poderosa ferramenta de reparo do sistema projetada para fornecer suporte para uma variedade de opções de reparo. Com esta ferramenta, os usuários podem redefinir facilmente os componentes do Windows Update, excluir arquivos temporários, verificar, detectar e reparar quaisquer corrupções na imagem do sistema Windows, verificar todos os arquivos protegidos do sistema, substituir quaisquer arquivos corrompidos, alterar valores inválidos no Registro do Windows, redefinir o Winsock configurações e muito mais. Esta ferramenta versátil pode ajudar os usuários a resolver uma variedade de problemas do sistema, tornando-se um componente essencial de qualquer kit de ferramentas abrangente de reparo do sistema.",
  "glosary": {
    "title": "Glossário",
    "dism": "Deployment Image Servicing and Management é uma ferramenta de linha de comando usada para montar e reparar imagens do Windows antes da implantação.",
    "fix-it": "É um programa de diagnóstico que permite detectar problemas que podem comprometer o bom funcionamento do Windows.",
    "registry": "É um banco de dados hierárquico central introduzido no Microsoft Windows 95 e Windows NT para armazenar as informações necessárias para configurar o sistema para um ou mais usuários, aplicativos e dispositivos de hardware.",
    "restore-point": "É uma representação de um estado armazenado dos arquivos do sistema do computador.",
    "sfc": "System File Checker é um utilitário do Windows que permite aos usuários verificar corrupções nos arquivos de sistema do Windows e restaurar arquivos danificados.",
    "winsock": "É uma biblioteca dinâmica de funções DLL para Windows, criada com a finalidade de implementar o TCP / IP. Inclui suporte para envio e recebimento de pacotes de dados através de soquetes BSD."
  },
  "references": {
    "title": "Referências",
    "reset-components": "Como faço para redefinir os componentes do Windows Update?",
    "sfc": "Use a ferramenta Verificador de Arquivos do Sistema para reparar arquivos de sistema ausentes ou corrompidos",
    "dism": "Corrigir erros do Windows Update usando o DISM ou a ferramenta de Preparação da Atualização do Sistema"
  }
}
